{
  "_name_or_path": "./HuggingFace",
  "add_bias_linear": true,
  "add_qkv_bias": true,
  "apply_query_key_layer_scaling": true,
  "apply_residual_connection_post_layernorm": true,
  "architectures": [
    "GLMModel"
  ],
  "attention_dropout": 0.0,
  "attention_softmax_in_fp32": true,
  "auto_map": {
    "AutoConfig": "configuration_glm.GLMConfig",
    "AutoModel": "modeling_glm.GLMForConditionalGeneration",
    "AutoModelForCausalLM": "modeling_glm.GLMForConditionalGeneration",
    "AutoModelForSeq2SeqLM": "modeling_glm.GLMForConditionalGeneration"
  },
  "batch_size": 1,
  "bias_dropout_fusion": true,
  "classifier_dropout": null,
  "deepnorm": true,
  "eos_token_id": 34,
  "experts_per_token": 2,
  "ffn_hidden_size": 3413,
  "fp32_residual_connection": false,
  "glu_activation": "geglu",
  "hidden_dropout": 0.0,
  "hidden_size": 1280,
  "is_causal": false,
  "kv_channels": 64,
  "layernorm_epsilon": 1e-05,
  "lora": false,
  "lora_alpha": 16,
  "lora_dropout": 0,
  "lora_r": 8,
  "mlp_lora": false,
  "model_type": "glm",
  "moe": false,
  "multi_query_attention": false,
  "multi_query_group_num": 2,
  "num_attention_heads": 20,
  "num_experts": 16,
  "num_layers": 24,
  "original_rope": true,
  "pad_token_id": 0,
  "padded_vocab_size": 512,
  "post_layer_norm": true,
  "pool_method": "attention",
  "species_pool_method": "mean",
  "out_dim": 512,
  "pre_seq_len": null,
  "prefix_projection": false,
  "quantization_bit": 0,
  "rmsnorm": false,
  "rotary_embedding_2d": false,
  "rotary_freq_base": 10000,
  "seq_length": 8192,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.43.2",
  "use_cache": true,
  "use_flash_attn": true,
  "use_pytorch_sdpa": true,
  "vocab_size": 512
}